In [1]:
import pandas as pd
import numpy as np
from sklearn import linear_model

In [5]:
df = pd.read_csv("hiring.csv")
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [71]:
import math
median_test_score = math.floor(df["test_score(out of 10)"].median())
median_test_score

8

In [73]:
df["test_score(out of 10)"]=df["test_score(out of 10)"].fillna(median_test_score)
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0         0.0                    8.0                           9      50000
1         0.0                    8.0                           6      45000
2         5.0                    6.0                           7      60000
3         2.0                   10.0                          10      65000
4         7.0                    9.0                           6      70000
5         3.0                    7.0                          10      62000
6        10.0                    8.0                           7      72000
7        11.0                    7.0                           8      80000

In [75]:
word_to_num = {
    'zero': 0, 'one': 1, 'two': 2, 'three': 3, 'four': 4,
    'five': 5, 'six': 6, 'seven': 7, 'eight': 8, 'nine': 9,
    'ten': 10, 'eleven': 11, 'twelve': 12
}

df['experience'] = df['experience'].replace(word_to_num)
df['experience'] = df['experience'].fillna(0)
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0         0.0                    8.0                           9      50000
1         0.0                    8.0                           6      45000
2         5.0                    6.0                           7      60000
3         2.0                   10.0                          10      65000
4         7.0                    9.0                           6      70000
5         3.0                    7.0                          10      62000
6        10.0                    8.0                           7      72000
7        11.0                    7.0                           8      80000

In [77]:
reg = linear_model.LinearRegression()
reg.fit(df[["experience","test_score(out of 10)","interview_score(out of 10)"]], df["salary($)"])
print("coef (m): ",reg.coef_)
print("intercept (b): ",reg.intercept_)

coef (m):  [2812.95487627 1845.70596798 2205.24017467]
intercept (b):  17737.263464337688

In [79]:
reg.predict(pd.DataFrame([[2,9,6]],columns=["experience","test_score(out of 10)","interview_score(out of 10)" ]))

array([53205.96797671])

In [81]:
## y = m1*x1+m2*x2+m3*x3+b
2812.95487627*2+1845.70596798*9+2205.24017467*6+ 17737.263464337688

53205.96797671769

In [83]:
reg.predict(pd.DataFrame([[12,10,10]], columns=["experience","test_score(out of 10)","interview_score(out of 10)"]))

array([92002.18340611])

In [85]:
2812.95487627*12+1845.70596798*10+2205.24017467*10+ 17737.263464337688

92002.18340607767